Repository: maib-ecomm/maib-prestashop
Catalog: modules/maib/translations/*/ModulesMaibAdmin.*.xlf
Languages: ro_ro, ru_ru

source: Maib Payment Gateway Module
ro_ro: Modulul Maib Payment Gateway
ru_ru: Модуль платежного шлюза Maib

source: Accept Visa / Mastercard / Apple Pay / Google Pay on your store with the Maib Payment Gateway Module
ro_ro: Acceptați Visa / Mastercard / Apple Pay / Google Pay în magazinul dvs. cu modulul Maib Payment Gateway
ru_ru: Принимайте Visa / Mastercard / Apple Pay / Google Pay в своем магазине с помощью модуля платежного шлюза Maib

source: General settings
ro_ro: Setări generale
ru_ru: Общие настройки

source: Project ID
ro_ro: ID proiect
ru_ru: ID проекта

source: Project ID from maibmerchants.md
ro_ro: ID-ul proiectului din maibmerchants.md
ru_ru: ID проекта из maibmerchants.md

source: Project Secret
ro_ro: Parola proiectului
ru_ru: Пароль проекта

source: Project Secret from maibmerchants.md. It is available after project activation.
ro_ro: Parola proiectului din maibmerchants.md. Este disponibilă după activarea proiectului.
ru_ru: Пароль проекта из maibmerchants.md. Доступен после активации проекта.

source: Signature Key
ro_ro: Cheia semnăturii
ru_ru: Ключ подписи

source: Signature Key for validating notifications на Callback URL. It is available after project activation.
ro_ro: Cheia semnăturii pentru validarea notificărilor на Callback URL. Este disponibilă după activarea proiectului.
ru_ru: Ключ подписи для валидации уведомлений на Callback URL. Доступен после активации проекта.

source: The "Project ID" field is required.
ro_ro: Câmpul "ID proiect" este obligatoriu.
ru_ru: Поле "ID проекта" является обязательным.

source: The "Project Secret" field is required.
ro_ro: Câmpul "Parola proiectului" este obligatoriu.
ru_ru: Поле "Пароль проекта" является обязательным.

source: The "Signature Key" field is required.
ro_ro: Câmpul "Cheia semnăturii" este obligatoriu.
ru_ru: Поле "Ключ подписи" является обязательным.

source: Are you sure about removing these details?
ro_ro: Sunteți sigur că eliminați aceste detalii?
ru_ru: Вы уверены, что хотите удалить эти данные?

source: Configuration Maib Merchants
ro_ro: Setări maibmerchants.md
ru_ru: Настройки maibmerchants.md

source: Configuration Order Status
ro_ro: Setãri stare comandã

source: Pending payment
ro_ro: Platã în așteptare
ru_ru: Платеж в ожидании

source: Completed payment
ro_ro: Platã cu succes
ru_ru: Успешная оплата

source: Failed payment
ro_ro: Platã eșuatã
ru_ru: Неуспешная оплата

source: Refunded payment
ro_ro: Platã returnatã
ru_ru: Возврат платежа

source: For payment refund, update the order status to the selected status. The funds will be returned to the customer card.
ro_ro: Pentru returnarea plății, actualizați starea comenzii la starea selectată. Suma va fi returnatã pe cardul clientului.
ru_ru: Для возврата платежа обновите статус заказа на выбранного статуса. Средства будут возвращены на карту клиента.

source: Title
ro_ro: Titlu
ru_ru: Заголовок

source: Payment method title that the customer will see during checkout
ro_ro: Titlul metodei de plată pe care clientul îl va vedea pe pagina de checkout
ru_ru: Название способа оплаты, которое покупатель увидит при оформлении заказа

source: Status
ro_ro: Stare
ru_ru: Статус

source: Debug
ro_ro: Depanare
ru_ru: Отладка

source: Record detailed debug info to the log file
ro_ro: Înregistrați informații detaliate de depanare în fișierul cu log-uri
ru_ru: Записывать подробную информацию об отладке в файл с логами

source: Sort Order
ro_ro: Ordinea de sortare
ru_ru: Порядок сортировки

source: Geo Zone
ro_ro: Zona geografică
ru_ru: Гео зона

source: Total
ro_ro: Suma totalã
ru_ru: Общая сумма

source: The total amount of the order for this payment method to become active
ro_ro: Suma totalã a comenzii de la care aceastã metodă de plată devine activă
ru_ru: Общая сумма заказа, с которого этот способ оплаты становится активным

source: OK URL Description
ro_ro: Adăugați acest link în câmpul Ok URL din setările Proiectului în maibmerchants.
ru_ru: Добавьте эту ссылку в поле Ok URL в настройках проекта в maibmerchants.

source: FAIL URL Description
ro_ro: Adăugați acest link în câmpul Fail URL din setările Proiectului în maibmerchants.
ru_ru: Добавьте эту ссылку в поле Fail URL в настройках проекта в maibmerchants.

source: Callback URL Description
ro_ro: Adăugați acest link în câmpul Callback URL din setările Proiectului în maibmerchants.
ru_ru: Добавьте эту ссылку в поле Callback URL в настройках проекта в maibmerchants.
